<html>
<head>
<title>Goro Races</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#000000" text="#FFFFFF" link="#FFFF00" vlink="#FFFF00" alink="#FFFF00">
<table width="80%" border="0" align="center">
  <tr> 
    <td> <div align="center"> 
        <p><img src="images/logo_banner.jpg" alt="Goro Races" width="200" height="80"></p>
        <h3 align="left">Indice</h3>
      </div>
      <ul>
        <li> 
          <div align="left"><a href="#Presentazione">Presentazione</a></div>
        </li>
        <li><a href="#GamePlay">Game Play</a></li>
        <li><a href="#GoroRaces32">GoroRaces32 </a> 
          <ul>
            <li><a href="#GoroRaces32_Tutorial">Tutorial</a></li>
            <li><a href="#GoroRaces32_Keys">Tasti</a></li>
          </ul>
        </li>
        <li><a href="#GoroRacesTrackEditor">Goro Races Track Editor </a> 
          <ul>
            <li><a href="#GoroRacesTrackEditor_Tutorial">Tutorial</a></li>
            <li><a href="#GoroRacesTrackEditor_Keys">Tasti</a></li>
          </ul>
        </li>
        <li><a href="#Download">Download</a></li>
      </ul>
      <div align="center"> 
        <h3 align="left"><a name="Presentazione"></a>Presentazione</h3>
        <p align="left"><a href="images/LGameMain.png" target="_self"><img src="images/SGameMain.png" alt="La schermata iniziale di Goro Races" width="300" height="210" border="0" align="right"></a>Goro 
          Races &egrave; un clone di un gioco apparso alcuni anni fa su Game Boy 
          di nome &quot;Power Racer&quot;. In poche parole questo gioco pu&ograve; 
          essere descritto come una sorta di Pac Man dove al posto della simpatica 
          pallina gialla abbiamo un ben pi&ugrave; reale bolide motorizzato.</p>
        <p align="left">&nbsp;</p>
        <h3 align="left"><a name="GamePlay"></a>Game Play</h3>
        <p align="left">L'area di gioco &egrave; un circuito quadrato dove sono 
          presenti dei muri disposti concentricamente. Tra un muro e l'altro sono 
          presenti delle pillole da raccogliere con la nostra auto (auto rossa). 
        </p>
        <p align="left">Ad ostacolare il nostro compito vi sar&agrave; un auto 
          guidata dal computer (auto blu) che cercher&agrave; in ogni momento 
          di imboccare in senso opposto la strada che stiamo percorrendo per poter 
          fare un bel frontale.</p>
        <p align="left">La difficolt&agrave; del gioco &egrave; data dal fatto 
          che la nostra auto avr&agrave; le seguenti limitazioni:</p>
        <div align="left"> 
          <ul>
            <li> &Egrave; possibile percorrere il circuito soltanto in senso antiorario 
              e non e' possibile eseguire inversioni di marcia</li>
            <li>Non e' possibile fermare la corsa della nostra auto, ma &egrave; 
              possibile decidere solo tra due possibili velocit&agrave; (low speed/high 
              speed) tramite il tasto SHIFT</li>
            <li> &Egrave; possibile cambiare corsia di marcia soltanto nei tratti 
              di percorso dove non sono presenti muri tramite i tasti freccia.</li>
          </ul>
        </div>
      </div>
      <div align="center"> 
        <div align="left"> 
          <p>&nbsp;</p>
          <h3><a name="GoroRaces32"></a>GoroRaces32</h3>
        </div>
      </div>
      <blockquote> 
        <div align="center"> 
          <div align="left"> 
            <h4><a name="GoroRaces32_Tutorial"></a>Tutorial</h4>
          </div>
        </div>
      </blockquote>
      <div align="center"> 
        <div align="left"> 
          <p><a href="images/LGamePlay.png" target="_self"><img src="images/SGamePlay.png" alt="Una sessione di gioco" width="300" height="210" border="0" align="right"></a>All'avvio 
            dell'eseguibile GoroRaces32.exe viene mostrata la <a href="images/LGameMain.png">schermata 
            iniziale</a>, che mostra un primo piano sulla nostra auto in movimento 
            sul circuito e la barra dei men&ugrave;.</p>
          <p>Premendo il tasto 'F2' o cliccando sul men&ugrave; Game-&gt;New viene 
            avviato un nuovo gioco, la visuale si sposta per inquadrare il circuito 
            dall'alto, la nostra macchina e quella avversaria vengono posizionate 
            nella loro posizione di partenza. L'auto al nostro comando &egrave; 
            quella che lampeggia per alcuni istanti subito dopo aver avviato un 
            nuovo gioco.</p>
          <p>Dopo alcuni istanti le auto cominciano a muoversi ciascuna nel verso 
            opposta all'altra e l'auto avversaria cercher&agrave;, ogni volta 
            che gli sar&agrave; possibile, di imboccare la nostra corsia.</p>
          <p>Si pu&ograve; spostare lateralmente la nostra auto con i tasti freccia 
            soltanto nel tratto dei rettilinei che non hanno muri ai lati delle 
            corsie. Si badi che i tasti spostano l'auto secondo la nostra visuale 
            e non a seconda di come l'auto &egrave; orientata. Ad esempio se stiamo 
            percorrendo il rettilineo a sinistra della visuale di gioco, con il 
            tasto 'LEFT' sposteremo la nostra auto verso le corsie pi&ugrave; 
            interne e con il tasto 'RIGHT' verso le corsie pi&ugrave; esterne. 
            Viceversa avverr&agrave; quando percorreremo il rettilineo alla sinistra 
            della visuale.</p>
          <p>Si pu&ograve; interrompere una sessione di gioco in ogni momento 
            premendo il tasto 'P' o selezionando il men&ugrave; Game-&gt;Pause.</p>
          <p> <a href="images/LGameWin.png" target="_self"><img src="images/SGameWin.png" alt="You Win !" width="300" height="210" border="0" align="right"></a>Una 
            volta raccolte tutte le palline disposte sul tracciato o se si scontra 
            la macchina avversaria verr&agrave; mostrato un <a href="images/LGameWin.png">breve 
            messaggio</a> di fine gioco e verr&agrave; quindi mostrata di nuovo 
            la schermata iniziale.</p>
          <p>Per caricare un tracciato diverso da quello predefinito (ad esempio 
            creato con il &quot;Track Editor&quot;, descritto in seguito) basta 
            selezionare il men&ugrave; Game-&gt;Load Track e quindi selezionare 
            il file desiderato.</p>
        </div>
      </div>
      <blockquote> 
        <div align="center"> 
          <div align="left"> 
            <h4><a name="GoroRaces32_Keys"></a>Tasti</h4>
            <table width="68%" border="0">
              <tr> 
                <td width="34%">- SU/GIU/DX/SX</td>
                <td width="66%">Cambio di corsia (solo in gioco)</td>
              </tr>
              <tr> 
                <td>- SHIFT</td>
                <td>Modalit&agrave; Hi Speed (solo in gioco)</td>
              </tr>
              <tr> 
                <td>- F2</td>
                <td>Nuovo gioco</td>
              </tr>
              <tr> 
                <td>- CTRL+T</td>
                <td>Caricamento tracciato *.grt</td>
              </tr>
              <tr> 
                <td>- P</td>
                <td>Pausa gioco (solo in gioco)</td>
              </tr>
              <tr>
                <td>- ALT+F4</td>
                <td>Esce da GoroRaces32</td>
              </tr>
            </table>
          <p>&nbsp;</p></div>
        </div>
      </blockquote>
      <div align="center"> 
        <div align="left"> 
          <h3><a name="GoroRacesTrackEditor"></a>Goro Races Track Editor</h3>
        </div>
      </div>
      <blockquote> 
        <div align="center"> 
          <div align="left"> 
            <h4><a name="GoroRacesTrackEditor_Tutorial"></a>Tutorial</h4>
          </div>
        </div>
      </blockquote>
      <div align="center"> 
        <div align="left"> 
          <p><a href="images/LEditorMain.png" target="_self"><img src="images/SEditorMain.png" alt="La schermata iniziale di Goro Races Track Editor" width="300" height="210" border="0" align="right"></a>L'editor 
            di Goro Races permette di creare o modificare le impostazioni delle 
            macchine in gara. &Egrave; possibile impostare la posizione di partenza 
            e la velocit&agrave; con cui ogni macchina cambia corsia, i valori 
            hi speed/lo speed ed il colore della carrozzeria. </p>
          <p>All'avvio dell'eseguibile &quot;Goro Races Track Editor.exe&quot; 
            verr&agrave; mostrata la <a href="images/LEditorMain.png">schermata 
            iniziale dell'editor</a> che contiene una visuale dall'alto sul circuito, 
            sulla sinistra un dialog che conterr&agrave; i dati dell'auto che 
            selezioneremo, la barra dei menu e una toolbar con i comandi principali.</p>
          <p>Le auto sono mostrate nella posizione iniziale che assumeranno una 
            volta che verr&agrave; avviato un nuovo gioco.</p>
          <p>Per poter cambiare gli attributi di un auto &egrave; necessario prima 
            selezionarne una cliccando con il TASTO SINISTRO direttamente su una 
            di esse oppure selezionando dal men&ugrave; &quot;Edit&quot; il sottomen&ugrave; 
            &quot;Human Car&quot; oppure &quot;Computer Car&quot;. L'auto selezionata 
            comincer&agrave; a lampeggiare ed il dialog sulla sinistra verr&agrave; 
            attivato e riempito con i dati relativi. Una volta selezionata una 
            delle due auto, sar&agrave; possibile agire direttamente sui parametri 
            del dialog per modificarne i parametri.</p>
          <p>Il dialog permette di modificare i seguenti dati:</p>
        </div>
      </div>
      <ul>
        <li> 
          <div align="center"> 
            <div align="left">Start position angle: angolo polare iniziale (l'angolo 
              0 corrisponde al rettilineo inizialmente a destra)</div>
          </div>
        </li>
        <li>Start position road: corsia iniziale (1 = corsia pi&ugrave; interna, 
          4 = corsia pi&ugrave; esterna)</li>
        <li>Lo Speed: velocit&agrave; di Lo Speed</li>
        <li>Hi Speed: velocit&agrave; di Hi Speed</li>
        <li>Traj Change: velocit&agrave; di cambio traiettoria</li>
        <li>Red Color: componente rossa del colore della carrozzeria</li>
        <li>Green Color: componente verde del colore della carrozzeria</li>
        <li>Blue Color: componente blu del colore della carrozzeria</li>
      </ul>
      <p>Cambiando i valori nelle varie caselle del dialog si modificano immediatamente 
        i parametri dell'auto selezionata. Ad esempio se si modifica la corsia 
        iniziale, la finestra a fianco mostrer&agrave; la macchina selezionata 
        nella nuova posizione iniziale.</p>
      <div align="center"> 
        <div align="left"> 
          <p>&Egrave; possibile modificare la posizione iniziale di un auto anche 
            trascinandola direttamente con il mouse nella posizione desiderata 
            tenendo premuto il TASTO SINISTRO. Il dialog aggiorner&agrave; automaticamente 
            i valori relativi alla nuova posizione iniziale dell'auto selezionata.</p>
        </div>
      </div>
      <p><a href="images/LEditorColorEdit.png" target="_self"><img src="images/SEditorColorEdit.png" alt="La finestra di editing del colore delle macchine" width="300" height="210" border="0" align="right"></a>Inoltre 
        premendo sul bottone &quot;Choose Color...&quot; verr&agrave; mostrata 
        una finestra con cui &egrave; possibile scegliere in maniera pi&ugrave; 
        intuitiva il nuovo colore della carrozzeria della macchina selezionata.</p>
      <p>Il tasto destro del mouse, infine, permette di modificare la posizione 
        della camera di vista come descritto nella sezione seguente.</p>
      <blockquote>
<div align="center"> 
          <div align="left"> 
            <h4><a name="GoroRacesTrackEditor_Keys"></a>Tasti</h4>
            <table width="100%" border="0">
              <tr> 
                <td>CTRL+N</td>
                <td>Nuovo documento</td>
              </tr>
              <tr> 
                <td>CTRL+O</td>
                <td>Apre un documento esistente</td>
              </tr>
              <tr> 
                <td>CTRL+S</td>
                <td>Salva il documento corrente</td>
              </tr>
              <tr> 
                <td>H</td>
                <td>Seleziona la macchina &quot;umana&quot;</td>
              </tr>
              <tr> 
                <td height="21">C</td>
                <td>Seleziona la macchina comandata dal computer</td>
              </tr>
              <tr> 
                <td height="21">Tasto Mouse Sx su un Auto</td>
                <td>Seleziona l'auto indicata</td>
              </tr>
              <tr> 
                <td height="21">Tasto Mouse Dx</td>
                <td>Permette di modificare l'altezza e l'angolatura della telecamera</td>
              </tr>
              <tr> 
                <td height="21">Tasto Mouse Dx+Sx</td>
                <td>Permette di spostare la telecamera e di modificarne l'angolatura</td>
              </tr>
              <tr>
                <td height="21">Alt+F4</td>
                <td>Esce da Goro Races Track Editor</td>
              </tr>
            </table>
          <p>&nbsp;</p></div>
        </div>
      </blockquote>
      <div align="center"> 
        <div align="left"> 
          <h3><a name="Download"></a>Download</h3>
        </div>
      </div></td>
  </tr>
</table>
<p>&nbsp;</p>
<p><font size="-1"> <em>Ultimo aggiornamento 
  <!-- #BeginDate format:fcSw1a -->Gioved&igrave;, 18 Settembre, 2003 3:35 PM<!-- #EndDate -->
  </em> </font></p>
</body>
</html>
